In [1]:
import numpy as np
import pandas as pd

In [5]:
a=pd.Series(np.arange(1,10),index=np.arange(100,109))
a

100    1
101    2
102    3
103    4
104    5
105    6
106    7
107    8
108    9
dtype: int32

In [7]:
a[100]

1

In [9]:
a[100:104]

Series([], dtype: int32)

In [11]:
a[[100,101]]

100    1
101    2
dtype: int32

In [13]:
a[:3]

100    1
101    2
102    3
dtype: int32

In [15]:
a[::2]

100    1
102    3
104    5
106    7
108    9
dtype: int32

In [17]:
a>2

100    False
101    False
102     True
103     True
104     True
105     True
106     True
107     True
108     True
dtype: bool

In [33]:
a[a > 2]
# Replace all values greater than 3 with 99
a[a > 3] = 99

In [27]:
a.replace(3, 30, inplace=True) #it goes ahead and replaced values in a else it will not do it in a

In [31]:
a
a.replace({2: 20, 4: 40}, inplace=True) #You can replace multiple values by passing a dictionary:

In [59]:
# fillna(),isnull.sum,notnull.sum

# The .isnull().sum() combination in Pandas is used to count the number of missing (null/NaN) values in each column of a DataFrame. Hereâ€™s how it works:

# isnull(): Checks each element for missing values, returning True for nulls and False for non-nulls.
# sum(): Sums up the True values in each column (since True is treated as 1 and False as 0), giving the count of missing values per column.
# Sample DataFrame with some missing values
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', None, 'David'],
    'Age': [24, None, 35, 40],
    'City': ['New York', None, 'Los Angeles', 'Chicago']
})

# Count missing values in each column
missing_values_count = df.isnull().sum()
notnull_values_count = df.notnull().sum()
print(missing_values_count)
print('********ðŸš€')
print(notnull_values_count)

Name    1
Age     1
City    1
dtype: int64
********ðŸš€
Name    3
Age     3
City    3
dtype: int64

In [37]:
# The .fillna() method in Pandas is used to replace missing (null/NaN) values with a specified value. 
# This can be useful for handling missing data by filling gaps with meaningful values.
# Fill missing values in all columns with a specified value
df_filled = df.fillna("Unknown")

print(df_filled)

      Name      Age         City
0    Alice     24.0     New York
1      Bob  Unknown      Unknown
2  Unknown     35.0  Los Angeles
3    David     40.0      Chicago

In [39]:
# Fill missing values with different values for each column
df_filled = df.fillna({'Name': 'Unknown', 'Age': df['Age'].mean(), 'City': 'Unknown'})

print(df_filled)

      Name   Age         City
0    Alice  24.0     New York
1      Bob  33.0      Unknown
2  Unknown  35.0  Los Angeles
3    David  40.0      Chicago

In [41]:
df['Age']

0    24.0
1     NaN
2    35.0
3    40.0
Name: Age, dtype: float64

In [43]:
df

    Name   Age         City
0  Alice  24.0     New York
1    Bob   NaN         None
2   None  35.0  Los Angeles
3  David  40.0      Chicago

In [47]:
# In-Place Filling
# If you want to modify the DataFrame directly without creating a new one, set inplace=True:
df.fillna("NA", inplace=True)

C:\Users\SFDCL\AppData\Local\Temp\ipykernel_10364\2381213229.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NA' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna("NA", inplace=True)

In [49]:
df

    Name   Age         City
0  Alice  24.0     New York
1    Bob    NA           NA
2     NA  35.0  Los Angeles
3  David  40.0      Chicago

In [61]:
ser1=pd.Series(np.arange(11,20))
ser1

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
dtype: int32

In [65]:
ser1.rename({1:'A'},inplace=True)

In [101]:
ser1
# Renaming all index labels
ser1.rename({1: 'A', 2: 'B', 3: 'C'}, inplace=True)

print(ser1)

0    11
A    12
B    13
C    14
4    15
5    16
6    17
7    18
8    19
dtype: int32

In [127]:
ser_reindexed = ser1.reindex([0,'A','B','C',5,6,7,8])

print(ser_reindexed)

0    11
A    12
B    13
C    14
5    16
6    17
7    18
8    19
dtype: int32

In [97]:
df=pd.DataFrame(np.arange(1,26).reshape(5,5),index=list('ABCDE'),columns=list('UVWXY'),dtype='float')

In [99]:
df

      U     V     W     X     Y
A   1.0   2.0   3.0   4.0   5.0
B   6.0   7.0   8.0   9.0  10.0
C  11.0  12.0  13.0  14.0  15.0
D  16.0  17.0  18.0  19.0  20.0
E  21.0  22.0  23.0  24.0  25.0

In [117]:
# Renaming all index labels
df.rename({'A': 'India', 'B': 'USA'}, inplace=True)
df.rename({'U': 'U2', 'v2': 'V2'}, inplace=True, axis=1)# to change column name
df

         U2    V2     W     X     Y
India   1.0   2.0   3.0   4.0   5.0
USA     6.0   7.0   8.0   9.0  10.0
C      11.0  12.0  13.0  14.0  15.0
D      16.0  17.0  18.0  19.0  20.0
E      21.0  22.0  23.0  24.0  25.0

In [137]:
df_drop=df.drop('U2',axis=1)
print(df_drop)
df_drop=df.drop('E',axis=0)
print(df_drop)

         V2     W     X     Y
India   2.0   3.0   4.0   5.0
USA     7.0   8.0   9.0  10.0
C      12.0  13.0  14.0  15.0
D      17.0  18.0  19.0  20.0
E      22.0  23.0  24.0  25.0
         U2    V2     W     X     Y
India   1.0   2.0   3.0   4.0   5.0
USA     6.0   7.0   8.0   9.0  10.0
C      11.0  12.0  13.0  14.0  15.0
D      16.0  17.0  18.0  19.0  20.0

In [161]:
df_drop
df_drop.drop('D',inplace=True)
print(df_drop)

         U2    V2     W     X     Y
India   1.0   2.0   3.0   4.0   5.0
USA     6.0   7.0   8.0   9.0  10.0
C      11.0  12.0  13.0  14.0  15.0

In [167]:
df_drop.drop(['U2','V2'],inplace=True,axis=1)

KeyError: "['U2', 'V2'] not found in axis"

In [169]:
print(df_drop)

          W     X     Y
India   3.0   4.0   5.0
USA     8.0   9.0  10.0
C      13.0  14.0  15.0

In [147]:
"""1. .rename()
Purpose: Changes index or column labels in a DataFrame or Series. It does not affect the actual data values, only the labels.

Usage: Used to rename specific row or column labels by passing a dictionary mapping old labels to new ones.
In-place: Can be used with inplace=True to modify the original object.

2. .replace()
Purpose: Replaces data values within a DataFrame or Series (not the labels). It is used to substitute specific values in the data with new values.

Usage: Useful for modifying the contents of cells, not the labels. You provide a dictionary or a scalar to specify which values should be replaced.
In-place: Can be used with inplace=True to modify the original object

3. .reindex()
Purpose: Changes the index of a DataFrame or Series to match a specified list of labels. Any indices in the new
list that were not in the original object will be added with NaN values by default. Itâ€™s typically used to add or remove rows or columns.
Note:no inplace option
Usage: Allows you to reorder, add, or remove rows or columns by specifying a new index.
In-place: Cannot modify the object in place; .reindex() always returns a new object.
"""

'1. .rename()\nPurpose: Changes index or column labels in a DataFrame or Series. It does not affect the actual data values, only the labels.\n\nUsage: Used to rename specific row or column labels by passing a dictionary mapping old labels to new ones.\nIn-place: Can be used with inplace=True to modify the original object.\n\n2. .replace()\nPurpose: Replaces data values within a DataFrame or Series (not the labels). It is used to substitute specific values in the data with new values.\n\nUsage: Useful for modifying the contents of cells, not the labels. You provide a dictionary or a scalar to specify which values should be replaced.\nIn-place: Can be used with inplace=True to modify the original object\n\n3. .reindex()\nPurpose: Changes the index of a DataFrame or Series to match a specified list of labels. Any indices in the new\nlist that were not in the original object will be added with NaN values by default. Itâ€™s typically used to add or remove rows or columns.\nNote:no inplace option\nUsage: Allows you to reorder, add, or remove rows or columns by specifying a new index.\nIn-place: Cannot modify the object in place; .reindex() always returns a new object.\n'

In [145]:
# Sample Series
ser = pd.Series([10, 20, 30], index=['a', 'b', 'c'])

# Rename index labels 'a' and 'c' to 'x' and 'z' respectively
ser.rename({'a': 'x', 'c': 'z'}, inplace=True)

print(ser)
# Replace value 20 with 200 in the Series
ser.replace(20, 200, inplace=True)

print(ser)
# Reindex the Series to have a new index
ser_reindexed = ser.reindex(['x', 'y', 'z'])

print(ser_reindexed)

x    10
b    20
z    30
dtype: int64
x     10
b    200
z     30
dtype: int64
x    10.0
y     NaN
z    30.0
dtype: float64

In [149]:
df.shape

(5, 5)

In [153]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, India to E
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   U2      5 non-null      float64
 1   V2      5 non-null      float64
 2   W       5 non-null      float64
 3   X       5 non-null      float64
 4   Y       5 non-null      float64
dtypes: float64(5)
memory usage: 412.0+ bytes

In [155]:
df.describe()

              U2         V2          W          X          Y
count   5.000000   5.000000   5.000000   5.000000   5.000000
mean   11.000000  12.000000  13.000000  14.000000  15.000000
std     7.905694   7.905694   7.905694   7.905694   7.905694
min     1.000000   2.000000   3.000000   4.000000   5.000000
25%     6.000000   7.000000   8.000000   9.000000  10.000000
50%    11.000000  12.000000  13.000000  14.000000  15.000000
75%    16.000000  17.000000  18.000000  19.000000  20.000000
max    21.000000  22.000000  23.000000  24.000000  25.000000

In [171]:
ser11=pd.Series([101,102,103,104,105])

In [173]:
ser11

0    101
1    102
2    103
3    104
4    105
dtype: int64

In [175]:
# DataFrame.insert(loc, column, value, allow_duplicates=False)

In [177]:
df[:]

         U2    V2     W     X     Y
India   1.0   2.0   3.0   4.0   5.0
USA     6.0   7.0   8.0   9.0  10.0
C      11.0  12.0  13.0  14.0  15.0
D      16.0  17.0  18.0  19.0  20.0
E      21.0  22.0  23.0  24.0  25.0

In [181]:
# loc[] function selects data by the label of the rows and column
# iloc[] function allowsus to retrieve rowsand columns bypositionExample: 
# Access the value that is at index 0 incolumn â€˜Nameâ€™

In [183]:
df2=pd.DataFrame( {'Students':['Ram','Laxmam','Mohan','Matthew','Rosy','Abdul','Jasbir','Anil','Ramya','Raju'],
 'Marks1':[55,45,37,88,77,66,77,45,98,99],
 'Marks2':[45,54,76,85,74,64,74,75,95,98]}
,index=list('ABCDEFGHIJ'))

In [185]:
df2

  Students  Marks1  Marks2
A      Ram      55      45
B   Laxmam      45      54
C    Mohan      37      76
D  Matthew      88      85
E     Rosy      77      74
F    Abdul      66      64
G   Jasbir      77      74
H     Anil      45      75
I    Ramya      98      95
J     Raju      99      98

In [189]:
df2[:]

  Students  Marks1  Marks2
A      Ram      55      45
B   Laxmam      45      54
C    Mohan      37      76
D  Matthew      88      85
E     Rosy      77      74
F    Abdul      66      64
G   Jasbir      77      74
H     Anil      45      75
I    Ramya      98      95
J     Raju      99      98

In [191]:
df2[2:5]

  Students  Marks1  Marks2
C    Mohan      37      76
D  Matthew      88      85
E     Rosy      77      74

In [193]:
df2[2:8:2]

  Students  Marks1  Marks2
C    Mohan      37      76
E     Rosy      77      74
G   Jasbir      77      74

In [197]:
# we will not be able to retrieve if we do this -column
df2[1,2]

KeyError: (1, 2)

In [203]:
df2[['Students','Marks1']]

  Students  Marks1
A      Ram      55
B   Laxmam      45
C    Mohan      37
D  Matthew      88
E     Rosy      77
F    Abdul      66
G   Jasbir      77
H     Anil      45
I    Ramya      98
J     Raju      99

In [207]:
df2.loc['A']

Students    Ram
Marks1       55
Marks2       45
Name: A, dtype: object

In [209]:
df2.loc['A':'C']

  Students  Marks1  Marks2
A      Ram      55      45
B   Laxmam      45      54
C    Mohan      37      76

In [211]:
df2.loc['A':'C','Marks1']

A    55
B    45
C    37
Name: Marks1, dtype: int64

In [213]:
df2.loc['A':'C','Students']

A       Ram
B    Laxmam
C     Mohan
Name: Students, dtype: object

In [219]:
df2[['A','B','C']]

KeyError: "None of [Index(['A', 'B', 'C'], dtype='object')] are in the [columns]"

In [221]:
df2.loc[['A','B','C']]

  Students  Marks1  Marks2
A      Ram      55      45
B   Laxmam      45      54
C    Mohan      37      76

In [235]:
df2.loc[::3,'Students':'Marks1']

  Students  Marks1
A      Ram      55
D  Matthew      88
G   Jasbir      77
J     Raju      99

In [239]:
df2.loc[::3,:'Marks1']

  Students  Marks1
A      Ram      55
D  Matthew      88
G   Jasbir      77
J     Raju      99

In [241]:
df2.loc['A'::3]

  Students  Marks1  Marks2
A      Ram      55      45
D  Matthew      88      85
G   Jasbir      77      74
J     Raju      99      98

In [249]:
df2.iloc[1:5:2,::2]

  Students  Marks2
B   Laxmam      54
D  Matthew      85

In [253]:
df2.iloc[::2,::2]

  Students  Marks2
A      Ram      45
C    Mohan      76
E     Rosy      74
G   Jasbir      74
I    Ramya      95

In [265]:
res=pd.Series(list('FFPPPPPPPP'),index=df2.index)
print(res)

A    F
B    F
C    P
D    P
E    P
F    P
G    P
H    P
I    P
J    P
dtype: object

In [263]:
res

A    F
B    F
C    P
D    P
E    P
F    P
G    P
H    P
I    P
J    P
dtype: object

In [269]:
df2['New Column']=res
print(df2)

  Students  Marks1  Marks2 New Column
A      Ram      55      45          F
B   Laxmam      45      54          F
C    Mohan      37      76          P
D  Matthew      88      85          P
E     Rosy      77      74          P
F    Abdul      66      64          P
G   Jasbir      77      74          P
H     Anil      45      75          P
I    Ramya      98      95          P
J     Raju      99      98          P

In [273]:
df2[df2['Marks1']>45]

  Students  Marks1  Marks2 New Column
A      Ram      55      45          F
D  Matthew      88      85          P
E     Rosy      77      74          P
F    Abdul      66      64          P
G   Jasbir      77      74          P
I    Ramya      98      95          P
J     Raju      99      98          P

In [281]:
df2[(df2['Marks1']>50) & (df2['Marks2']<80)]

  Students  Marks1  Marks2 New Column
A      Ram      55      45          F
E     Rosy      77      74          P
F    Abdul      66      64          P
G   Jasbir      77      74          P

In [283]:
# In the context of Pandas Series (and generally with NumPy arrays), 
# the & operator is performing a bitwise AND operation,
# but it's being used in a logical (element-wise) context when applied to boolean conditions.

# How & Works with Pandas Series
# In Pandas, the & operator is used for element-wise logical AND between two boolean conditions. 
# It works in a similar way to how bitwise operators work on binary numbers,
# but since we are working with boolean conditions (True or False values), it applies logic like this:

# True & True â†’ True
# True & False â†’ False
# False & True â†’ False
# False & False â†’ False
# Why Use & Instead of and
# In Python, and is used for logical operations on single boolean values (not element-wise operations). 
# When you're dealing with Series in Pandas, you need an operator that works on each 
# element of the Series individually. That's why & is used for element-wise logical AND.
# Similarly, you would use | for element-wise logical OR.

# Creating two boolean Series
s1 = pd.Series([True, False, True, False])
s2 = pd.Series([False, True, True, False])

# Element-wise bitwise AND
result = s1 & s2

print(result)

0    False
1    False
2     True
3    False
dtype: bool

In [291]:
df2[(df2['Marks1']>50) | (df2['Marks2']<80)]

  Students  Marks1  Marks2 New Column
A      Ram      55      45          F
B   Laxmam      45      54          F
C    Mohan      37      76          P
D  Matthew      88      85          P
E     Rosy      77      74          P
F    Abdul      66      64          P
G   Jasbir      77      74          P
H     Anil      45      75          P
I    Ramya      98      95          P
J     Raju      99      98          P

In [293]:
 df2[~(df2['Marks1'] > 80)] #the NOT operation for boolean values is performed using the ~ (tilde) operator in Pandas, 
# which is used for element-wise negation of boolean values.

  Students  Marks1  Marks2 New Column
A      Ram      55      45          F
B   Laxmam      45      54          F
C    Mohan      37      76          P
E     Rosy      77      74          P
F    Abdul      66      64          P
G   Jasbir      77      74          P
H     Anil      45      75          P

In [295]:
df2[~((df2['Marks1'] > 80) & (df2['Marks2'] < 80))]

  Students  Marks1  Marks2 New Column
A      Ram      55      45          F
B   Laxmam      45      54          F
C    Mohan      37      76          P
D  Matthew      88      85          P
E     Rosy      77      74          P
F    Abdul      66      64          P
G   Jasbir      77      74          P
H     Anil      45      75          P
I    Ramya      98      95          P
J     Raju      99      98          P

In [299]:
print(df2)
df2['Rank']=df2['Marks1'].rank()

  Students  Marks1  Marks2 New Column
A      Ram      55      45          F
B   Laxmam      45      54          F
C    Mohan      37      76          P
D  Matthew      88      85          P
E     Rosy      77      74          P
F    Abdul      66      64          P
G   Jasbir      77      74          P
H     Anil      45      75          P
I    Ramya      98      95          P
J     Raju      99      98          P

In [301]:
df2

  Students  Marks1  Marks2 New Column  Rank
A      Ram      55      45          F   4.0
B   Laxmam      45      54          F   2.5
C    Mohan      37      76          P   1.0
D  Matthew      88      85          P   8.0
E     Rosy      77      74          P   6.5
F    Abdul      66      64          P   5.0
G   Jasbir      77      74          P   6.5
H     Anil      45      75          P   2.5
I    Ramya      98      95          P   9.0
J     Raju      99      98          P  10.0

In [303]:
df2['RankAsc']=df2['Marks1'].rank(ascending=False)
df2

  Students  Marks1  Marks2 New Column  Rank  RankAsc
A      Ram      55      45          F   4.0      7.0
B   Laxmam      45      54          F   2.5      8.5
C    Mohan      37      76          P   1.0     10.0
D  Matthew      88      85          P   8.0      3.0
E     Rosy      77      74          P   6.5      4.5
F    Abdul      66      64          P   5.0      6.0
G   Jasbir      77      74          P   6.5      4.5
H     Anil      45      75          P   2.5      8.5
I    Ramya      98      95          P   9.0      2.0
J     Raju      99      98          P  10.0      1.0

In [305]:
df_sorted = df2.sort_values(by='RankAsc', ascending=True)

print(df_sorted)

  Students  Marks1  Marks2 New Column  Rank  RankAsc
J     Raju      99      98          P  10.0      1.0
I    Ramya      98      95          P   9.0      2.0
D  Matthew      88      85          P   8.0      3.0
E     Rosy      77      74          P   6.5      4.5
G   Jasbir      77      74          P   6.5      4.5
F    Abdul      66      64          P   5.0      6.0
A      Ram      55      45          F   4.0      7.0
B   Laxmam      45      54          F   2.5      8.5
H     Anil      45      75          P   2.5      8.5
C    Mohan      37      76          P   1.0     10.0

In [307]:
df2['RankDense']=df2['Marks1'].rank(method='dense')
df2

  Students  Marks1  Marks2 New Column  Rank  RankAsc  RankDense
A      Ram      55      45          F   4.0      7.0        3.0
B   Laxmam      45      54          F   2.5      8.5        2.0
C    Mohan      37      76          P   1.0     10.0        1.0
D  Matthew      88      85          P   8.0      3.0        6.0
E     Rosy      77      74          P   6.5      4.5        5.0
F    Abdul      66      64          P   5.0      6.0        4.0
G   Jasbir      77      74          P   6.5      4.5        5.0
H     Anil      45      75          P   2.5      8.5        2.0
I    Ramya      98      95          P   9.0      2.0        7.0
J     Raju      99      98          P  10.0      1.0        8.0

In [311]:
df2['RankDense']=df2['Marks1'].rank(method='dense')
df2

  Students  Marks1  Marks2 New Column  Rank  RankAsc  RankDense
A      Ram      55      45          F   4.0      7.0        3.0
B   Laxmam      45      54          F   2.5      8.5        2.0
C    Mohan      37      76          P   1.0     10.0        1.0
D  Matthew      88      85          P   8.0      3.0        6.0
E     Rosy      77      74          P   6.5      4.5        5.0
F    Abdul      66      64          P   5.0      6.0        4.0
G   Jasbir      77      74          P   6.5      4.5        5.0
H     Anil      45      75          P   2.5      8.5        2.0
I    Ramya      98      95          P   9.0      2.0        7.0
J     Raju      99      98          P  10.0      1.0        8.0

In [313]:
df2['RankMax']=df2['Marks1'].rank(method='max')
df2

  Students  Marks1  Marks2 New Column  Rank  RankAsc  RankDense  RankMax
A      Ram      55      45          F   4.0      7.0        3.0      4.0
B   Laxmam      45      54          F   2.5      8.5        2.0      3.0
C    Mohan      37      76          P   1.0     10.0        1.0      1.0
D  Matthew      88      85          P   8.0      3.0        6.0      8.0
E     Rosy      77      74          P   6.5      4.5        5.0      7.0
F    Abdul      66      64          P   5.0      6.0        4.0      5.0
G   Jasbir      77      74          P   6.5      4.5        5.0      7.0
H     Anil      45      75          P   2.5      8.5        2.0      3.0
I    Ramya      98      95          P   9.0      2.0        7.0      9.0
J     Raju      99      98          P  10.0      1.0        8.0     10.0

In [317]:
df

         U2    V2     W     X     Y
India   1.0   2.0   3.0   4.0   5.0
USA     6.0   7.0   8.0   9.0  10.0
C      11.0  12.0  13.0  14.0  15.0
D      16.0  17.0  18.0  19.0  20.0
E      21.0  22.0  23.0  24.0  25.0

In [321]:
df_copy=df.copy()

In [323]:
df_copy

         U2    V2     W     X     Y
India   1.0   2.0   3.0   4.0   5.0
USA     6.0   7.0   8.0   9.0  10.0
C      11.0  12.0  13.0  14.0  15.0
D      16.0  17.0  18.0  19.0  20.0
E      21.0  22.0  23.0  24.0  25.0

In [325]:
df2=df2.drop(['I','J'])
df2_copy=df2.copy()
#df2_dropped = df2.drop(['Marks1', 'Marks2'], axis=1) along columns

In [327]:
df2_copy

  Students  Marks1  Marks2 New Column  Rank  RankAsc  RankDense  RankMax
A      Ram      55      45          F   4.0      7.0        3.0      4.0
B   Laxmam      45      54          F   2.5      8.5        2.0      3.0
C    Mohan      37      76          P   1.0     10.0        1.0      1.0
D  Matthew      88      85          P   8.0      3.0        6.0      8.0
E     Rosy      77      74          P   6.5      4.5        5.0      7.0
F    Abdul      66      64          P   5.0      6.0        4.0      5.0
G   Jasbir      77      74          P   6.5      4.5        5.0      7.0
H     Anil      45      75          P   2.5      8.5        2.0      3.0

In [331]:
pd.concat([df2_copy,df2])

  Students  Marks1  Marks2 New Column  Rank  RankAsc  RankDense  RankMax
A      Ram      55      45          F   4.0      7.0        3.0      4.0
B   Laxmam      45      54          F   2.5      8.5        2.0      3.0
C    Mohan      37      76          P   1.0     10.0        1.0      1.0
D  Matthew      88      85          P   8.0      3.0        6.0      8.0
E     Rosy      77      74          P   6.5      4.5        5.0      7.0
F    Abdul      66      64          P   5.0      6.0        4.0      5.0
G   Jasbir      77      74          P   6.5      4.5        5.0      7.0
H     Anil      45      75          P   2.5      8.5        2.0      3.0
A      Ram      55      45          F   4.0      7.0        3.0      4.0
B   Laxmam      45      54          F   2.5      8.5        2.0      3.0
C    Mohan      37      76          P   1.0     10.0        1.0      1.0
D  Matthew      88      85          P   8.0      3.0        6.0      8.0
E     Rosy      77      74          P   6.5      4.5        5.0      7.0
F    Abdul      66      64          P   5.0      6.0        4.0      5.0
G   Jasbir      77      74          P   6.5      4.5        5.0      7.0
H     Anil      45      75          P   2.5      8.5        2.0      3.0

In [333]:
pd.concat([df2_copy,df2],axis=1)

,Students,Marks1,Marks2,New Column,Rank,RankAsc,RankDense,RankMax,Students,Marks1,Marks2,New Column,Rank,RankAsc,RankDense,RankMax
A,Ram,55,45,F,4.0,7.0,3.0,4.0,Ram,55,45,F,4.0,7.0,3.0,4.0
B,Laxmam,45,54,F,2.5,8.5,2.0,3.0,Laxmam,45,54,F,2.5,8.5,2.0,3.0
C,Mohan,37,76,P,1.0,10.0,1.0,1.0,Mohan,37,76,P,1.0,10.0,1.0,1.0
D,Matthew,88,85,P,8.0,3.0,6.0,8.0,Matthew,88,85,P,8.0,3.0,6.0,8.0
E,Rosy,77,74,P,6.5,4.5,5.0,7.0,Rosy,77,74,P,6.5,4.5,5.0,7.0
F,Abdul,66,64,P,5.0,6.0,4.0,5.0,Abdul,66,64,P,5.0,6.0,4.0,5.0
G,Jasbir,77,74,P,6.5,4.5,5.0,7.0,Jasbir,77,74,P,6.5,4.5,5.0,7.0
H,Anil,45,75,P,2.5,8.5,2.0,3.0,Anil,45,75,P,2.5,8.5,2.0,3.0

In [337]:
pd.concat([df,df2],axis=1) #Note if rows and column don't match it will give NaN

,U2,V2,W,X,Y,Students,Marks1,Marks2,New Column,Rank,RankAsc,RankDense,RankMax
India,1.0,2.0,3.0,4.0,5.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
USA,6.0,7.0,8.0,9.0,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
C,11.0,12.0,13.0,14.0,15.0,Mohan,37.0,76.0,P,1.0,10.0,1.0,1.0
D,16.0,17.0,18.0,19.0,20.0,Matthew,88.0,85.0,P,8.0,3.0,6.0,8.0
E,21.0,22.0,23.0,24.0,25.0,Rosy,77.0,74.0,P,6.5,4.5,5.0,7.0
A,NaN,NaN,NaN,NaN,NaN,Ram,55.0,45.0,F,4.0,7.0,3.0,4.0
B,NaN,NaN,NaN,NaN,NaN,Laxmam,45.0,54.0,F,2.5,8.5,2.0,3.0
F,NaN,NaN,NaN,NaN,NaN,Abdul,66.0,64.0,P,5.0,6.0,4.0,5.0
G,NaN,NaN,NaN,NaN,NaN,Jasbir,77.0,74.0,P,6.5,4.5,5.0,7.0
H,NaN,NaN,NaN,NaN,NaN,Anil,45.0,75.0,P,2.5,8.5,2.0,3.0

In [343]:
pd.concat([df,df2],axis=0).drop(['RankDense', 'RankMax'], axis=1).drop(['C', 'D'], axis=0)

,U2,V2,W,X,Y,Students,Marks1,Marks2,New Column,Rank,RankAsc
India,1.0,2.0,3.0,4.0,5.0,NaN,NaN,NaN,NaN,NaN,NaN
USA,6.0,7.0,8.0,9.0,10.0,NaN,NaN,NaN,NaN,NaN,NaN
E,21.0,22.0,23.0,24.0,25.0,NaN,NaN,NaN,NaN,NaN,NaN
A,NaN,NaN,NaN,NaN,NaN,Ram,55.0,45.0,F,4.0,7.0
B,NaN,NaN,NaN,NaN,NaN,Laxmam,45.0,54.0,F,2.5,8.5
E,NaN,NaN,NaN,NaN,NaN,Rosy,77.0,74.0,P,6.5,4.5
F,NaN,NaN,NaN,NaN,NaN,Abdul,66.0,64.0,P,5.0,6.0
G,NaN,NaN,NaN,NaN,NaN,Jasbir,77.0,74.0,P,6.5,4.5
H,NaN,NaN,NaN,NaN,NaN,Anil,45.0,75.0,P,2.5,8.5

In [345]:
pwd #present working directory

'C:\\Users\\SFDCL\\Documents'

In [ ]:
"""Here's a list of methods for reading different file formats into a Pandas DataFrame:

CSV: pd.read_csv()
Excel: pd.read_excel()
JSON: pd.read_json()
SQL: pd.read_sql()
Parquet: pd.read_parquet()
HDF5: pd.read_hdf()
Feather: pd.read_feather()
Stata: pd.read_stata()
Google BigQuery: read_gbq() (from pandas-gbq library)
Clipboard: pd.read_clipboard()
HTML: pd.read_html()
Text: pd.read_fwf(), pd.read_table()"""

In [353]:
# Specify the file path
file_path = r'D:\Repositories\python-Basics\101124\2.+Faculty+Notebook\2. Faculty Notebook\example.csv'  # Replace with the actual path to your CSV file

# Load the CSV file into a DataFrame
df_file = pd.read_csv(file_path)

# Display the DataFrame
print(df_file)

    Age  Weight (in kg)  Height (in m)
0    45              60           1.35
1    12              43           1.21
2    54              78           1.50
3    26              65           1.21
4    68              50           1.32
5    21              43           1.52
6    10              32           1.65
7    57              34           1.61
8    75              23           1.24
9    32              21           1.52
10   23              53           1.50
11   34              65           1.76
12   55              89           1.65
13   23              45           1.75
14   56              76           1.69
15   67              78           1.85
16   26              65           1.21
17   56              74           1.69
18   67              78           1.85
19   26              65           1.21
20   68              50           1.32
21   56              76           1.69
22   67              78           1.85

In [355]:
# Load the CSV file into a DataFrame #present working directory
df_file2 = pd.read_csv('example.csv')

# Display the DataFrame
print(df_file2)

    Age  Weight (in kg)  Height (in m)
0    45              60           1.35
1    12              43           1.21
2    54              78           1.50
3    26              65           1.21
4    68              50           1.32
5    21              43           1.52
6    10              32           1.65
7    57              34           1.61
8    75              23           1.24
9    32              21           1.52
10   23              53           1.50
11   34              65           1.76
12   55              89           1.65
13   23              45           1.75
14   56              76           1.69
15   67              78           1.85
16   26              65           1.21
17   56              74           1.69
18   67              78           1.85
19   26              65           1.21
20   68              50           1.32
21   56              76           1.69
22   67              78           1.85

In [361]:
df_file3 = pd.read_excel('example2.xlsx')

# Display the DataFrame
print(df_file3)

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female  150000
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600

In [363]:
df = pd.read_fwf('example.txt')

In [365]:
df

         Country\tBirth rate\tLife expectancy
0                Vietnam\t1.822\t74.828243902
1                Vanuatu\t3.869\t70.819487805
2                  Tonga\t3.911\t72.150658537
3            Timor-Leste\t5.578\t61.999853659
4               Thailand\t1.579\t73.927658537
5        Solomon Islands\t4.229\t67.465195122
6               Singapore\t1.15\t81.641463415
7                   Samoa\t3.86\t72.306390244
8            Philippines\t3.142\t68.484317073
9       Papua New Guinea\t3.951\t62.440609756
10            New Zealand\t2.16\t80.702439024
11         New Caledonia\t2.141\t76.301682927
12               Myanmar\t2.002\t64.662097561
13              Mongolia\t2.504\t68.194975610
14            Micronesia\t3.451\t68.764829268
15              Malaysia\t2.635\t74.024560976
16      Macao SAR, China\t1.092\t80.775317073
17                     Lao PDR\t2.747\t67.064
18                  Korea\t1.22\t80.761951220
19                  Japan\t1.39\t82.932682927
20             Indonesia\t2.117\t68.889658537
21  Hong Kong SAR, China\t1.108\t82.878048780
22                   Guam\t2.47\t75.994268293
23       French Polynesia\t2.09\t75.076878049
24                  Fiji\t2.668\t69.225829268
25       Dem. Rep. Korea\t2.022\t68.532146341
26                 China\t1.598\t73.273097561

In [367]:
df = pd.read_excel('example2.xlsx',sheet_name=1)

In [369]:
df

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female       0
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600

In [385]:
df_excel_0 = pd.read_excel('example2.xlsx',sheet_name=0)
df_excel_1  = pd.read_excel('example2.xlsx',sheet_name=1)
print(df_excel_0)
print('ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€')
print(df_excel_1)
print('ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€Default Join')
pd.merge(df_excel_0,df_excel_1,on='Age') #default is inner join

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female  150000
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600
6   20    Male    3456
7   19  Female    4567
ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€
   Age  Gender   Salary
0   45    Male  40000.0
1   12    Male      NaN
2   54  Female      0.0
3   26    Male  30000.0
4   64  Female  15000.0
5   21  Female  25600.0
6   49   Male   55670.0
7   44  Female  44440.0
ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€Default Join

   Age Gender_x  Salary_x Gender_y  Salary_y
0   45     Male     40000     Male   40000.0
1   12     Male         0     Male       NaN
2   54   Female    150000   Female       0.0
3   26     Male     30000     Male   30000.0
4   64   Female     15000   Female   15000.0
5   21   Female     25600   Female   25600.0

In [ ]:
"""Other Join Types (how argument):
inner (default): Only rows with matching values in both DataFrames will be included.
left: All rows from the left DataFrame and matching rows from the right DataFrame. 
Non-matching rows from the right will have NaN values.
right: All rows from the right DataFrame and matching rows from the left DataFrame. 
Non-matching rows from the left will have NaN values."""

In [379]:
pd.merge(df_excel_0,df_excel_1,on='Age', how='inner')

   Age Gender_x  Salary_x Gender_y  Salary_y
0   45     Male     40000     Male   40000.0
1   12     Male         0     Male       NaN
2   54   Female    150000   Female       0.0
3   26     Male     30000     Male   30000.0
4   64   Female     15000   Female   15000.0
5   21   Female     25600   Female   25600.0

In [387]:
pd.merge(df_excel_0,df_excel_1,on='Age', how='left')

   Age Gender_x  Salary_x Gender_y  Salary_y
0   45     Male     40000     Male   40000.0
1   12     Male         0     Male       NaN
2   54   Female    150000   Female       0.0
3   26     Male     30000     Male   30000.0
4   64   Female     15000   Female   15000.0
5   21   Female     25600   Female   25600.0
6   20     Male      3456      NaN       NaN
7   19   Female      4567      NaN       NaN

In [389]:
pd.merge(df_excel_0,df_excel_1,on='Age', how='right')

   Age Gender_x  Salary_x Gender_y  Salary_y
0   45     Male   40000.0     Male   40000.0
1   12     Male       0.0     Male       NaN
2   54   Female  150000.0   Female       0.0
3   26     Male   30000.0     Male   30000.0
4   64   Female   15000.0   Female   15000.0
5   21   Female   25600.0   Female   25600.0
6   49      NaN       NaN    Male    55670.0
7   44      NaN       NaN   Female   44440.0

In [391]:
pd.merge(df_excel_0, df_excel_1, on='Age', how='outer')
"""Outer Join (how='outer'): Returns all rows from both DataFrames, and fills in missing values with NaN
where there is no match. This is often used when you want to retain all data from both DataFrames,
regardless of whether there is a matching 'Age' in both DataFrames."""

   Age Gender_x  Salary_x Gender_y  Salary_y
0   12     Male       0.0     Male       NaN
1   19   Female    4567.0      NaN       NaN
2   20     Male    3456.0      NaN       NaN
3   21   Female   25600.0   Female   25600.0
4   26     Male   30000.0     Male   30000.0
5   44      NaN       NaN   Female   44440.0
6   45     Male   40000.0     Male   40000.0
7   49      NaN       NaN    Male    55670.0
8   54   Female  150000.0   Female       0.0
9   64   Female   15000.0   Female   15000.0

In [3]:
header=pd.MultiIndex.from_product([['Karnataka','Andra'],['Jan','Feburary','March']])
print(header)

MultiIndex([('Karnataka',      'Jan'),
            ('Karnataka', 'Feburary'),
            ('Karnataka',    'March'),
            (    'Andra',      'Jan'),
            (    'Andra', 'Feburary'),
            (    'Andra',    'March')],
           )

In [5]:
print('Hi')

Hi

In [7]:
header2=pd.MultiIndex.from_product([['Sem1','Sem2'],['Phy','Chem','Maths','Bio']])
print(header2)

MultiIndex([('Sem1',   'Phy'),
            ('Sem1',  'Chem'),
            ('Sem1', 'Maths'),
            ('Sem1',   'Bio'),
            ('Sem2',   'Phy'),
            ('Sem2',  'Chem'),
            ('Sem2', 'Maths'),
            ('Sem2',   'Bio')],
           )

In [35]:
data=pd.DataFrame([[1,2,3,4,5,6],[11,22,33,44,55,66],[22,33,22,11,22,33]],columns=header,index=['A','B','C',])
print(data)

  Karnataka                Andra
        Jan Feburary March   Jan Feburary March
A         1        2     3     4        5     6
B        11       22    33    44       55    66
C        22       33    22    11       22    33

In [37]:
data2=pd.DataFrame([[1,2,3,4,5,6,7,8],[11,22,33,44,55,66,77,88],[22,33,22,11,22,33,99,101]],columns=header2,index=['A','B','C',])
print(data2)

  Sem1                Sem2
   Phy Chem Maths Bio  Phy Chem Maths  Bio
A    1    2     3   4    5    6     7    8
B   11   22    33  44   55   66    77   88
C   22   33    22  11   22   33    99  101

In [39]:
data2.stack(level=1,future_stack=True)

         Sem1  Sem2
A Phy       1     5
  Chem      2     6
  Maths     3     7
  Bio       4     8
B Phy      11    55
  Chem     22    66
  Maths    33    77
  Bio      44    88
C Phy      22    22
  Chem     33    33
  Maths    22    99
  Bio      11   101

In [41]:
data2.stack(level=0,future_stack=True)

        Phy  Chem  Maths  Bio
A Sem1    1     2      3    4
  Sem2    5     6      7    8
B Sem1   11    22     33   44
  Sem2   55    66     77   88
C Sem1   22    33     22   11
  Sem2   22    33     99  101

In [53]:
s1=pd.Series(np.arange(1,11))
s2=pd.Series(np.arange(21,31))
s3=pd.concat([s1,s2],keys=['src1','src2'],names=['Source','Index'])
print(s1)
print(s2)
print('ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€')
print(s3)
s3.index

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32
0    21
1    22
2    23
3    24
4    25
5    26
6    27
7    28
8    29
9    30
dtype: int32
ðŸš€ðŸš€ðŸš€ðŸš€ðŸš€
Source  Index
src1    0         1
        1         2
        2         3
        3         4
        4         5
        5         6
        6         7
        7         8
        8         9
        9        10
src2    0        21
        1        22
        2        23
        3        24
        4        25
        5        26
        6        27
        7        28
        8        29
        9        30
dtype: int32

MultiIndex([('src1', 0),
            ('src1', 1),
            ('src1', 2),
            ('src1', 3),
            ('src1', 4),
            ('src1', 5),
            ('src1', 6),
            ('src1', 7),
            ('src1', 8),
            ('src1', 9),
            ('src2', 0),
            ('src2', 1),
            ('src2', 2),
            ('src2', 3),
            ('src2', 4),
            ('src2', 5),
            ('src2', 6),
            ('src2', 7),
            ('src2', 8),
            ('src2', 9)],
           names=['Source', 'Index'])

In [55]:
s3.index

MultiIndex([('src1', 0),
            ('src1', 1),
            ('src1', 2),
            ('src1', 3),
            ('src1', 4),
            ('src1', 5),
            ('src1', 6),
            ('src1', 7),
            ('src1', 8),
            ('src1', 9),
            ('src2', 0),
            ('src2', 1),
            ('src2', 2),
            ('src2', 3),
            ('src2', 4),
            ('src2', 5),
            ('src2', 6),
            ('src2', 7),
            ('src2', 8),
            ('src2', 9)],
           names=['Source', 'Index'])

In [57]:
s3.src1

Index
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [65]:
print(s3.loc['src1'])

Index
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32